-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: localhost    Database: school_timetable
-- ------------------------------------------------------
-- Server version	8.0.34

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `subject`
--

DROP TABLE IF EXISTS `subject`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `subject` (
  `SubjectID` int NOT NULL AUTO_INCREMENT,
  `SubjectCode` varchar(45) NOT NULL,
  `SubjectName` varchar(100) NOT NULL,
  `Credit` enum('0.5','1.0','1.5','2.0') NOT NULL,
  `Category` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT '-',
  `SubjectProgram` varchar(100) NOT NULL DEFAULT '-',
  PRIMARY KEY (`SubjectID`),
  UNIQUE KEY `SubjectID_UNIQUE` (`SubjectID`)
) ENGINE=InnoDB AUTO_INCREMENT=154 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `subject`
--

LOCK TABLES `subject` WRITE;
/*!40000 ALTER TABLE `subject` DISABLE KEYS */;
INSERT INTO `subject` VALUES (1,'ก23901','แนะแนว','0.5','กิจกรรม','-'),(2,'I20201','การสือสารและการนำเสนอข้อมูล','0.5','กิจกรรม','-'),(3,'I30201','โครงงาน','0.5','กิจกรรม','-'),(4,'ก32901','แนะแนว','0.5','กิจกรรม','-'),(5,'ท21101','ภาษาไทยพื้นฐาน','1.5','ภาษาไทย','-'),(6,'ท31101','ภาษาไทยพื้นฐาน','1.0','ภาษาไทย','-'),(7,'ท32101','ภาษาไทยพื้นฐาน','1.0','ภาษาไทย','-'),(8,'ท33101','ภาษาไทยพื้นฐาน','1.0','ภาษาไทย','-'),(9,'ท21201','ภาษาไทยเพิ่มเติม','1.0','ภาษาไทย','-'),(10,'ก30931','รักษ์ภาษาไทย','1.0','ชุมนุม','-'),(11,'ก30931','แนะแนว','0.5','กิจกรรม','-'),(12,'ท22101','ภาษาไทยพื้นฐาน','1.5','ภาษาไทย','-'),(13,'ท23201','ภาษาไทยเพิ่มเติม','1.0','ภาษาไทย','-'),(14,'ท23101','ภาษาไทยพื้นฐาน','1.5','ภาษาไทย','-'),(15,'ก20931','รักษ์การอ่าน','1.0','ชุมนุม','-'),(16,'ก22911','ลูกเสือสามัญรุ่นใหญ่','1.0','กิจกรรม','-'),(17,'ก32931','แนะแนว','0.5','กิจกรรม','-'),(18,'ค21101','คณิตศาสตร์พื้นฐาน','1.5','คณิตศาสตร์','-'),(19,'ค22101','คณิตศาสตร์พื้นฐาน','1.5','คณิตศาสตร์','-'),(20,'ก20931','ห้องสมุด','0.5','ชุมนุม','-'),(21,'ก22911','ยุวกาชาด','0.5','กิจกรรม','-'),(22,'ก22921','ยุวกาชาด','0.5','กิจกรรม','-'),(23,'ก21901','แนะแนว','0.5','กิจกรรม','-'),(24,'ก22911','โครงงาน','0.5','กิจกรรม','-'),(25,'ค21201','คณิตศาสตร์เพิ่มเติม','1.0','คณิตศาสตร์','-'),(26,'ค22201','คณิตศาสตร์เพิ่มเติม','1.0','คณิตศาสตร์','-'),(27,'ค23201','คณิตศาสตร์เพิ่มเติม','1.5','คณิตศาสตร์','-'),(28,'ก33901','แนะแนว','0.5','กิจกรรม','-'),(29,'I32101','การศึกษาค้นคว้าฯ','0.5','กิจกรรม','-'),(30,'ค32101','คณิตศาสตร์พื้นฐาน','1.0','คณิตศาสตร์','-'),(31,'ค31201','คณิตศาสตร์เพิ่มเติม','1.5','คณิตศาสตร์','-'),(32,'ค32203','คณิตศาสตร์สร้างสรรค์ 3','1.5','คณิตศาสตร์','-'),(33,'ค31203','คณิตศาสตร์สร้างสรรค์ 2','1.5','คณิตศาสตร์','-'),(34,'ก22922','ยุวกาชาด','0.5','กิจกรรม','-'),(35,'ก21901','แนะแนว','0.5','กิจกรรม','-'),(36,'ก20936','โครงงาน','0.5','กิจกรรม','-'),(37,'ค31101','คณิตศาสตร์พื้นฐาน','1.0','คณิตศาสตร์','-'),(38,'ค32201','คณิตศาสตร์เพิ่มเติม','1.5','คณิตศาสตร์','-'),(39,'ค33201','คณิตศาสตร์เพิ่มเติม','1.5','คณิตศาสตร์','-'),(40,'ก20931','ยุวชนคนพอเพียง','0.5','ชุมนุม','-'),(41,'ก30931','สภาพาเพลิน','0.5','ชุมนุม','-'),(43,'ว30221','เคมี 1','1.5','วิทยาศาสตร์','-'),(44,'ว30223','เคมี 3','1.0','วิทยาศาสตร์','-'),(45,'ว30297','เคมีในชีวิตประจำวัน 2','1.0','วิทยาศาสตร์','-'),(46,'ว30225','เคมี 5','1.5','วิทยาศาสตร์','-'),(47,'ว32101','วิทย์กายภาพ','1.0','วิทยาศาสตร์','-'),(50,'I30201','การศึกษาค้นคว้าฯ','0.5','กิจกรรม','-'),(51,'ว30241','ชีววิทยา 1','1.0','วิทยาศาสตร์','-'),(52,'ว30243','ชีววิทยา 3','1.5','วิทยาศาสตร์','-'),(53,'ว30299','ชีวกับชีวิต','1.0','วิทยาศาสตร์','-'),(54,'ว30245','ชีววิทยา 5','1.5','วิทยาศาสตร์','-'),(55,'ก20931','รักษ์พลังงานสิ่งแวดล้อม','0.5','ชุมนุม','-'),(56,'ก30931','รักษ์พลังงานสิ่งแวดล้อม','0.5','ชุมนุม','-'),(57,'ก31901','แนะแนว','0.5','กิจกรรม','-'),(58,'ว22101','วิทยาศาสตร์','1.5','วิทยาศาสตร์','-'),(59,'ว23101','วิทยาศาสตร์','1.5','วิทยาศาสตร์','-'),(60,'ว31101','วิทย์-ชีวภาพ','1.0','วิทยาศาสตร์','-'),(61,'ว21201','สนุกกับวิทยาศาสตร์','1.0','วิทยาศาสตร์','-'),(62,'ว30201','ฟิสิกส์ 1','2.0','วิทยาศาสตร์','-'),(63,'ว30203','ฟิสิกส์ 3','1.5','วิทยาศาสตร์','-'),(64,'ก23911','ลูกเสือสามัญรุ่นใหญ่','1.0','ชุมนุม','-'),(65,'ก22901','แนะแนว','0.5','กิจกรรม','-'),(66,'ว23201','วิทยาศาสตร์เพิ่มเติม','1.5','วิทยาศาสตร์','-'),(67,'ว30212','โลก ดาราศาสตร์และอวกาศ','1.0','วิทยาศาสตร์','-'),(68,'ว30205','ฟิสิกส์ 3','2.0','วิทยาศาสตร์','-'),(69,'ว33101','โลก ดาราศาสตร์และอวกาศ','0.5','วิทยาศาสตร์','-'),(70,'ก20931','เครื่องบินพลังยาง','0.5','กิจกรรม','-'),(71,'ก33911','นักษึกษาวิชาทหาร','0.5','กิจกรรม','-'),(72,'ก21901','นักษึกษาวิชาทหาร','0.5','กิจกรรม','-'),(73,'I23901','การศึกษาค้นคว้าฯ','0.5','กิจกรรม','-'),(74,'ว21101','วิทยาศาสตร์พื้นฐาน','1.5','วิทยาศาสตร์','-'),(75,'ว22201','การสร้างนวัตกรรม','1.0','วิทยาศาสตร์','-'),(76,'ว30294','หุ่นยนต์ 1','1.0','วิทยาศาสตร์','-'),(77,'ว20931','หุ่นยนต์','0.5','วิทยาศาสตร์','-'),(78,'ก23912','ลูกเสือสามัญรุ่นใหญ่','0.5','กิจกรรม','-'),(79,'ว21171','เทคโนโลยี(การคำนวณ) 1','0.5','วิทยาศาสตร์','-'),(80,'ว22171','เทคโนโลยี(การคำนวณ) 3','0.5','วิทยาศาสตร์','-'),(81,'ว23171','เทคโนโลยี(การคำนวณ) 5','0.5','วิทยาศาสตร์','-'),(82,'ว31171','เทคโนโลยี(การคำนวณ) 1','0.5','วิทยาศาสตร์','-'),(83,'ว32171','เทคโนโลยี(การคำนวณ) 3','0.5','วิทยาศาสตร์','-'),(84,'ว33171','เทคโนโลยี(การคำนวณ) 5','0.5','วิทยาศาสตร์','-'),(85,'ว30288','การออกแบบฐานข้อมูลเบื้องต้น','1.0','วิทยาศาสตร์','-'),(86,'ว30286','การออกแบบกราฟฟิกและโปรแกรม','1.0','วิทยาศาสตร์','-'),(87,'ก20931','คอมพิวเตอร์','0.5','ชุมนุม','-'),(88,'ก32912','ลูกเสือสามัญรุ่นใหญ่','0.5','กิจกรรม','-'),(89,'ก23902','แนะแนว','0.5','กิจกรรม','-'),(90,'ก20936','โครงงาน','0.5','กิจกรรม','-'),(91,'อ21101','ภาษาอังกฤษพื้นฐาน','1.5','ภาษาต่างประเทศ','-'),(92,'อ32201','ภาษาอังกฤษเพิ่มเติม','1.0','ภาษาต่างประเทศ','-'),(93,'อ33201','ภาษาอังกฤษเพิ่มเติม','1.0','ภาษาต่างประเทศ','-'),(94,'อ22101','ภาษาอังกฤษพื้นฐาน','1.5','ภาษาต่างประเทศ','-'),(95,'อ31101','ภาษาอังกฤษพื้นฐาน','1.0','ภาษาต่างประเทศ','-'),(96,'อ32101','ภาษาอังกฤษพื้นฐาน','1.0','ภาษาต่างประเทศ','-'),(97,'จ21201','ภาษาจีน','1.0','ภาษาต่างประเทศ','-'),(98,'จ22201','ภาษาจีน','1.0','ภาษาต่างประเทศ','-'),(99,'จ23201','ภาษาจีน','1.0','ภาษาต่างประเทศ','-'),(100,'จ31201','ภาษาจีน','1.0','ภาษาต่างประเทศ','-'),(101,'จ31201','ภาษาจีน','0.5','ภาษาต่างประเทศ','-'),(102,'จ32201','ภาษาจีน','1.0','ภาษาต่างประเทศ','-'),(103,'ก31201','ภาษาจีน','0.5','ภาษาต่างประเทศ','-'),(104,'ส21101','สังคมพื้นฐาน 1','1.5','สังคมศึกษา ศาสนา และวัฒนธรรม','-'),(105,'ส22106','ประวัติศาสตร์ 3','0.5','สังคมศึกษา ศาสนา และวัฒนธรรม','-'),(106,'ส22104','ประวัติศาสตร์ 1','0.5','สังคมศึกษา ศาสนา และวัฒนธรรม','-'),(107,'ส20239','เศรษฐกิจพอเพียง 1','0.5','สังคมศึกษา ศาสนา และวัฒนธรรม','-'),(108,'ก20931','สังคมน่ารู้','0.5','ชุมนุม','-'),(109,'ก21901','ยุวกาชาด','0.5','กิจกรรม','-'),(110,'ส22101','สังคมพื้นฐาน 3','1.5','สังคมศึกษา ศาสนา และวัฒนธรรม','-'),(111,'ส23101','สังคมพื้นฐาน 5','1.5','สังคมศึกษา ศาสนา และวัฒนธรรม','-'),(112,'ส23108','ประวัติศาสตร์ 5','0.5','สังคมศึกษา ศาสนา และวัฒนธรรม','-'),(113,'ง22101','การงานอาชีพ','0.5','การงานอาชีพและเทคโนโลยี','-'),(114,'ง22201','การงานเพิ่มเติม','1.0','การงานอาชีพและเทคโนโลยี','-'),(115,'ง23101','การงานอาชีพ','0.5','การงานอาชีพและเทคโนโลยี','-'),(116,'ง20201','การงานเพิ่มเติม','1.0','การงานอาชีพและเทคโนโลยี','-'),(117,'ง23201','การงานเพิ่มเติม','1.0','การงานอาชีพและเทคโนโลยี','-'),(118,'ง32201','การงานอาชีพ','0.5','การงานอาชีพและเทคโนโลยี','-'),(119,'ศ23101','ดนตรี 1','1.0','ศิลปะ','-'),(120,'ศ31101','ดนตรี 1','0.5','ศิลปะ','-'),(121,'ศ32101','ทัศนศิลป์ 1','0.5','ศิลปะ','-'),(122,'ก30931','การงานอาชีพ','0.5','ชุมนุม','-'),(123,'พ23101','สุขศึกษา','0.5','สุขศึกษาและพลศึกษา','-'),(124,'พ21101','สุขศึกษา 1','0.5','สุขศึกษาและพลศึกษา','-'),(125,'พ21103','ยิมนาสติก','0.5','สุขศึกษาและพลศึกษา','-'),(126,'พ22101','สุขศึกษา 3','0.5','สุขศึกษาและพลศึกษา','-'),(127,'พ23103','ฟุตบอล','0.5','สุขศึกษาและพลศึกษา','-'),(128,'พ22103','วอลเลย์บอล','0.5','สุขศึกษาและพลศึกษา','-'),(129,'พ21201','กรีฑา','1.0','สุขศึกษาและพลศึกษา','-'),(130,'พ22201','ฟุตซอล','1.0','สุขศึกษาและพลศึกษา','-'),(131,'พ31101','สุขศึกษาและพลศึกษา','0.5','สุขศึกษาและพลศึกษา','-'),(132,'พ32101','สุขศึกษาและพลศึกษา','0.5','สุขศึกษาและพลศึกษา','-'),(133,'พ33101','สุขศึกษาและพลศึกษา','0.5','สุขศึกษาและพลศึกษา','-'),(134,'พ23201','ตะกร้อ','1.0','สุขศึกษาและพลศึกษา','-'),(135,'ก20931','กีฬา','0.5','ชุมนุม','-'),(136,'ง21101','การงานอาชีพ 1','0.5','การงานอาชีพและเทคโนโลยี','-'),(137,'ง31101','การงานอาชีพ 1','0.5','การงานอาชีพและเทคโนโลยี','-'),(138,'ง30203','งานประดิษฐ์ใบตอง','1.0','การงานอาชีพและเทคโนโลยี','-'),(139,'ง33203','งานประดิษฐ์','1.0','การงานอาชีพและเทคโนโลยี','-'),(140,'ง33101','การงานอาชีพ 5','0.5','การงานอาชีพและเทคโนโลยี','-'),(141,'ก20931','นาฏศิลป์','0.5','ชุมนุม','-'),(142,'ก30931','นาฏศิลป์','0.5','ชุมนุม','-'),(143,'ศ21101','ทัศนศิลป์ 1','1.0','ศิลปะ','-'),(144,'ศ22101','นาฏศิลป์ 1','1.0','ศิลปะ','-'),(145,'ศ33101','นาฏศิลป์ 5','0.5','ศิลปะ','-'),(146,'ก20932','นาฏศิลป์','0.5','ชุมนุม','-'),(147,'ก30932','นาฏศิลป์','0.5','ชุมนุม','-'),(148,'I20201','การศึกษาค้นคว้าฯ','0.5','กิจกรรม','-'),(150,'ก20931','กีฬา','0.5','ชุมนุม','-'),(151,'ก20931','ชุมนุม ม.ต้น','0.5','ชุมนุม','-'),(152,'ก30931','ชุมนุม ม.ปลาย','0.5','ชุมนุม','-'),(153,'ก22922','ลูกเสือ/ยุวกาชาด','0.5','กิจกรรม','-');
/*!40000 ALTER TABLE `subject` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-12-07  1:33:01
