-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 34.27.217.57    Database: school-timetable-db-dev
-- ------------------------------------------------------
-- Server version	8.0.31-google

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
SET @MYSQLDUMP_TEMP_LOG_BIN = @@SESSION.SQL_LOG_BIN;
SET @@SESSION.SQL_LOG_BIN= 0;

--
-- GTID state at the beginning of the backup 
--

SET @@GLOBAL.GTID_PURGED=/*!80000 '+'*/ '0ae2ccd9-bb2e-11ee-9a14-42010a400004:1-3108,
11cd8659-9f67-11ee-afa0-42010a400002:1-473106';

--
-- Table structure for table `subject`
--

DROP TABLE IF EXISTS `subject`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `subject` (
  `SubjectCode` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `SubjectName` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `Credit` enum('CREDIT_05','CREDIT_10','CREDIT_15','CREDIT_20') COLLATE utf8mb4_unicode_ci NOT NULL,
  `Category` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '-',
  `ProgramID` int DEFAULT NULL,
  PRIMARY KEY (`SubjectCode`),
  KEY `subject_ProgramID_fkey` (`ProgramID`),
  CONSTRAINT `subject_ProgramID_fkey` FOREIGN KEY (`ProgramID`) REFERENCES `program` (`ProgramID`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `subject`
--

LOCK TABLES `subject` WRITE;
/*!40000 ALTER TABLE `subject` DISABLE KEYS */;
INSERT INTO `subject` VALUES ('ddddd','asadasda','CREDIT_15','ภาษาต่างประเทศ',NULL),('I20201','การสือสารและการนำเสนอข้อมูล','CREDIT_05','กิจกรรม',NULL),('I23901','การศึกษาค้นคว้าฯ','CREDIT_05','กิจกรรม',NULL),('I30201','โครงงาน','CREDIT_05','กิจกรรม',NULL),('I30203','การศึกษาค้นคว้าฯ','CREDIT_05','กิจกรรม',NULL),('I32101','การศึกษาค้นคว้าฯ','CREDIT_05','กิจกรรม',NULL),('ก20931','ชุมนุม ม.ต้น','CREDIT_05','ชุมนุม',NULL),('ก20932','นาฏศิลป์','CREDIT_05','ชุมนุม',NULL),('ก20936','โครงงาน','CREDIT_05','กิจกรรม',NULL),('ก21901','แนะแนว','CREDIT_05','กิจกรรม',NULL),('ก22921','ยุวกาชาด','CREDIT_05','กิจกรรม',NULL),('ก22922','ลูกเสือ/ยุวกาชาด','CREDIT_05','กิจกรรม',NULL),('ก23901','แนะแนว','CREDIT_05','กิจกรรม',NULL),('ก23902','แนะแนว','CREDIT_05','กิจกรรม',NULL),('ก23912','ลูกเสือสามัญรุ่นใหญ่','CREDIT_05','กิจกรรม',NULL),('ก30931','ชุมนุม ม.ปลาย','CREDIT_05','ชุมนุม',NULL),('ก30932','นาฏศิลป์','CREDIT_05','ชุมนุม',NULL),('ก31201','ภาษาจีน','CREDIT_05','ภาษาต่างประเทศ',NULL),('ก31901','แนะแนว','CREDIT_05','กิจกรรม',NULL),('ก32901','แนะแนว','CREDIT_05','กิจกรรม',NULL),('ก32912','ลูกเสือสามัญรุ่นใหญ่','CREDIT_05','กิจกรรม',NULL),('ก32931','แนะแนว','CREDIT_05','กิจกรรม',NULL),('ก33901','แนะแนว','CREDIT_05','กิจกรรม',NULL),('ก33911','นักษึกษามีส่วนร่วม','CREDIT_05','กิจกรรม',NULL),('ค21101','คณิตศาสตร์พื้นฐาน','CREDIT_15','คณิตศาสตร์',NULL),('ค21201','คณิตศาสตร์เพิ่มเติม','CREDIT_10','คณิตศาสตร์',NULL),('ค22101','คณิตศาสตร์พื้นฐาน','CREDIT_15','คณิตศาสตร์',NULL),('ค22201','คณิตศาสตร์เพิ่มเติม','CREDIT_10','คณิตศาสตร์',NULL),('ค23201','คณิตศาสตร์เพิ่มเติม','CREDIT_15','คณิตศาสตร์',NULL),('ค31101','คณิตศาสตร์พื้นฐาน','CREDIT_10','คณิตศาสตร์',NULL),('ค31201','คณิตศาสตร์เพิ่มเติม','CREDIT_15','คณิตศาสตร์',NULL),('ค31203','คณิตศาสตร์สร้างสรรค์ 2','CREDIT_15','คณิตศาสตร์',NULL),('ค32101','คณิตศาสตร์พื้นฐาน','CREDIT_10','คณิตศาสตร์',NULL),('ค32201','คณิตศาสตร์เพิ่มเติม','CREDIT_15','คณิตศาสตร์',NULL),('ค32203','คณิตศาสตร์สร้างสรรค์ 3','CREDIT_15','คณิตศาสตร์',NULL),('ค33201','คณิตศาสตร์เพิ่มเติม','CREDIT_15','คณิตศาสตร์',NULL),('ง20201','การงานเพิ่มเติม','CREDIT_10','การงานอาชีพและเทคโนโลยี',NULL),('ง21101','การงานอาชีพ 1','CREDIT_05','การงานอาชีพและเทคโนโลยี',NULL),('ง22101','การงานอาชีพ','CREDIT_05','การงานอาชีพและเทคโนโลยี',NULL),('ง22201','การงานเพิ่มเติม','CREDIT_10','การงานอาชีพและเทคโนโลยี',NULL),('ง23101','การงานอาชีพ','CREDIT_05','การงานอาชีพและเทคโนโลยี',NULL),('ง23201','การงานเพิ่มเติม','CREDIT_10','การงานอาชีพและเทคโนโลยี',NULL),('ง30203','งานประดิษฐ์ใบตอง','CREDIT_10','การงานอาชีพและเทคโนโลยี',NULL),('ง31101','การงานอาชีพ 1','CREDIT_05','การงานอาชีพและเทคโนโลยี',NULL),('ง32201','การงานอาชีพ','CREDIT_05','การงานอาชีพและเทคโนโลยี',NULL),('ง33101','การงานอาชีพ 5','CREDIT_05','การงานอาชีพและเทคโนโลยี',NULL),('ง33203','งานประดิษฐ์','CREDIT_10','การงานอาชีพและเทคโนโลยี',NULL),('จ21201','ภาษาจีน','CREDIT_10','ภาษาต่างประเทศ',NULL),('จ22201','ภาษาจีน','CREDIT_10','ภาษาต่างประเทศ',NULL),('จ23201','ภาษาจีน','CREDIT_10','ภาษาต่างประเทศ',NULL),('จ31201','ภาษาจีน','CREDIT_10','ภาษาต่างประเทศ',NULL),('จ32201','ภาษาจีน','CREDIT_10','ภาษาต่างประเทศ',NULL),('ท21101','ภาษาไทยพื้นฐาน','CREDIT_15','ภาษาไทย',NULL),('ท21201','ภาษาไทยเพิ่มเติม','CREDIT_10','ภาษาไทย',NULL),('ท22101','ภาษาไทยพื้นฐาน','CREDIT_15','ภาษาไทย',NULL),('ท23101','ภาษาไทยพื้นฐาน','CREDIT_15','ภาษาไทย',NULL),('ท23201','ภาษาไทยเพิ่มเติม','CREDIT_10','ภาษาไทย',NULL),('ท31101','ภาษาไทยพื้นฐาน','CREDIT_10','ภาษาไทย',NULL),('ท32101','ภาษาไทยพื้นฐาน','CREDIT_10','ภาษาไทย',NULL),('ท33101','ภาษาไทยพื้นฐาน','CREDIT_10','ภาษาไทย',NULL),('พ21101','สุขศึกษา 1','CREDIT_05','สุขศึกษาและพลศึกษา',NULL),('พ21103','ยิมนาสติก','CREDIT_05','สุขศึกษาและพลศึกษา',NULL),('พ21201','กรีฑา','CREDIT_10','สุขศึกษาและพลศึกษา',NULL),('พ22101','สุขศึกษา 3','CREDIT_05','สุขศึกษาและพลศึกษา',NULL),('พ22103','วอลเลย์บอล','CREDIT_05','สุขศึกษาและพลศึกษา',NULL),('พ22201','ฟุตซอล','CREDIT_10','สุขศึกษาและพลศึกษา',NULL),('พ23101','สุขศึกษา','CREDIT_05','สุขศึกษาและพลศึกษา',NULL),('พ23103','ฟุตบอล','CREDIT_05','สุขศึกษาและพลศึกษา',NULL),('พ23201','ตะกร้อ','CREDIT_10','สุขศึกษาและพลศึกษา',NULL),('พ31101','สุขศึกษาและพลศึกษา','CREDIT_05','สุขศึกษาและพลศึกษา',NULL),('พ32101','สุขศึกษาและพลศึกษา','CREDIT_05','สุขศึกษาและพลศึกษา',NULL),('พ33101','สุขศึกษาและพลศึกษา','CREDIT_05','สุขศึกษาและพลศึกษา',NULL),('ว20931','หุ่นยนต์','CREDIT_05','วิทยาศาสตร์',NULL),('ว21101','วิทยาศาสตร์พื้นฐาน','CREDIT_15','วิทยาศาสตร์',NULL),('ว21171','เทคโนโลยี(การคำนวณ) 1','CREDIT_05','วิทยาศาสตร์',NULL),('ว21201','สนุกกับวิทยาศาสตร์','CREDIT_10','วิทยาศาสตร์',NULL),('ว22101','วิทยาศาสตร์','CREDIT_15','วิทยาศาสตร์',NULL),('ว22171','เทคโนโลยี(การคำนวณ) 3','CREDIT_05','วิทยาศาสตร์',NULL),('ว22201','การสร้างนวัตกรรม','CREDIT_10','วิทยาศาสตร์',NULL),('ว22901','แนะแนว','CREDIT_05','กิจกรรม',NULL),('ว23101','วิทยาศาสตร์','CREDIT_15','วิทยาศาสตร์',NULL),('ว23171','เทคโนโลยี(การคำนวณ) 5','CREDIT_05','วิทยาศาสตร์',NULL),('ว23201','วิทยาศาสตร์เพิ่มเติม','CREDIT_15','วิทยาศาสตร์',NULL),('ว23911','ลูกเสือสามัญรุ่นใหญ่','CREDIT_10','ชุมนุม',NULL),('ว30201','ฟิสิกส์ 1','CREDIT_20','วิทยาศาสตร์',NULL),('ว30203','ฟิสิกส์ 3','CREDIT_15','วิทยาศาสตร์',NULL),('ว30205','ฟิสิกส์ 3','CREDIT_20','วิทยาศาสตร์',NULL),('ว30212','โลก ดาราศาสตร์และอวกาศ','CREDIT_10','วิทยาศาสตร์',NULL),('ว30221','เคมี 1','CREDIT_15','วิทยาศาสตร์',NULL),('ว30223','เคมี 3','CREDIT_10','วิทยาศาสตร์',NULL),('ว30225','เคมี 5','CREDIT_15','วิทยาศาสตร์',NULL),('ว30228','การออกแบบเชิงสถาปัตยกรรม','CREDIT_10','วิทยาศาสตร์',NULL),('ว30241','ชีววิทยา 1','CREDIT_10','วิทยาศาสตร์',NULL),('ว30243','ชีววิทยา 3','CREDIT_15','วิทยาศาสตร์',NULL),('ว30245','ชีววิทยา 5','CREDIT_15','วิทยาศาสตร์',NULL),('ว30286','การออกแบบกราฟฟิกและโปรแกรม','CREDIT_10','วิทยาศาสตร์',NULL),('ว30288','การออกแบบฐานข้อมูลเบื้องต้น','CREDIT_10','วิทยาศาสตร์',NULL),('ว30294','หุ่นยนต์ 1','CREDIT_10','วิทยาศาสตร์',NULL),('ว30297','เคมีในชีวิตประจำวัน 2','CREDIT_10','วิทยาศาสตร์',NULL),('ว30299','ชีวกับชีวิต','CREDIT_10','วิทยาศาสตร์',NULL),('ว31101','วิทย์-ชีวภาพ','CREDIT_10','วิทยาศาสตร์',NULL),('ว31103','วิทย์-เคมี','CREDIT_10','วิทยาศาสตร์',NULL),('ว31171','เทคโนโลยี(การคำนวณ) 1','CREDIT_05','วิทยาศาสตร์',NULL),('ว31201','วิทย์-ฟิสิกส์','CREDIT_10','วิทยาศาสตร์',NULL),('ว32101','วิทย์กายภาพ','CREDIT_10','วิทยาศาสตร์',NULL),('ว32171','เทคโนโลยี(การคำนวณ) 3','CREDIT_05','วิทยาศาสตร์',NULL),('ว33101','โลก ดาราศาสตร์และอวกาศ','CREDIT_05','วิทยาศาสตร์',NULL),('ว33171','เทคโนโลยี(การคำนวณ) 5','CREDIT_05','วิทยาศาสตร์',NULL),('ศ21101','ทัศนศิลป์ 1','CREDIT_10','ศิลปะ',NULL),('ศ22101','นาฏศิลป์ 1','CREDIT_10','ศิลปะ',NULL),('ศ23101','ดนตรี 1','CREDIT_10','ศิลปะ',NULL),('ศ31101','ดนตรี 1','CREDIT_05','ศิลปะ',NULL),('ศ32101','ทัศนศิลป์ 1','CREDIT_05','ศิลปะ',NULL),('ศ33101','นาฏศิลป์ 5','CREDIT_05','ศิลปะ',NULL),('ส20239','เศรษฐกิจพอเพียง 1','CREDIT_05','สังคมศึกษา ศาสนา และวัฒนธรรม',NULL),('ส21101','สังคมพื้นฐาน 1','CREDIT_15','สังคมศึกษา ศาสนา และวัฒนธรรม',NULL),('ส22101','สังคมพื้นฐาน 3','CREDIT_15','สังคมศึกษา ศาสนา และวัฒนธรรม',NULL),('ส22104','ประวัติศาสตร์ 1','CREDIT_05','สังคมศึกษา ศาสนา และวัฒนธรรม',NULL),('ส22106','ประวัติศาสตร์ 3','CREDIT_05','สังคมศึกษา ศาสนา และวัฒนธรรม',NULL),('ส23101','สังคมพื้นฐาน 5','CREDIT_15','สังคมศึกษา ศาสนา และวัฒนธรรม',NULL),('ส23108','ประวัติศาสตร์ 5','CREDIT_05','สังคมศึกษา ศาสนา และวัฒนธรรม',NULL),('อ21101','ภาษาอังกฤษพื้นฐาน','CREDIT_15','ภาษาต่างประเทศ',NULL),('อ22101','ภาษาอังกฤษพื้นฐาน','CREDIT_15','ภาษาต่างประเทศ',NULL),('อ31101','ภาษาอังกฤษพื้นฐาน','CREDIT_10','ภาษาต่างประเทศ',NULL),('อ32101','ภาษาอังกฤษพื้นฐาน','CREDIT_10','ภาษาต่างประเทศ',NULL),('อ32201','ภาษาอังกฤษเพิ่มเติม','CREDIT_10','ภาษาต่างประเทศ',NULL),('อ33201','ภาษาอังกฤษเพิ่มเติม','CREDIT_10','ภาษาต่างประเทศ',NULL),('อ34201','ภาษาอังกฤษเพิ่มเติม','CREDIT_10','ภาษาต่างประเทศ',NULL);
/*!40000 ALTER TABLE `subject` ENABLE KEYS */;
UNLOCK TABLES;
SET @@SESSION.SQL_LOG_BIN = @MYSQLDUMP_TEMP_LOG_BIN;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-01-25 13:22:49
